C2CRIBuildDir/projects/C2C-RI/src/RIGUI/CustomTestSuites/TMDDV301ExtensionToBlankTestSuite/InfoLayer/Data/TCS-7-dlFullEventUpdateUpdate-EC-InValid-4.data

 
#<!--   
#       Title:  TCS-7-dlFullEventUpdateUpdate-EC-InValid-4
#       Description:  This test case is used to verify the SUTs support of the dlFullEventUpdateUpdate dialog as an EC using the variable values specified by the Test Plan.   This test case supports verification of requirements related to user need 2.3.4.2 [Need for Current Event Information]. This Test Case tests for a InValid (4) response result.
#       Related Procedure:  TPS-7-dlFullEventUpdateUpdate-EC
#       Version/Date: 2012/02/14 22:36:42
#-->

#ITERATION NAME = One
#GROUP NAME = General
#PARAMETER TYPE = boolean
#EDITABLE = true
#DOCUMENTATION = This variable represents whether the Test Case is expected to pass.
CheckOutcomePassed = true

#PARAMETER TYPE = String
#EDITABLE = false
#DOCUMENTATION = This variable represents whether the Test Case is expected to pass.
VerificationSpec = #VALUESPEC#Values#VALUESPEC#

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable identifies the Application Layer Standard that will be used for this test.
ApplicationLayerStandard = NTCIP2306v01

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Publication Message to be sent to the SUT.
PublicationMessage = <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://www.tmdd.org/302/messages"><soapenv:Header/><soapenv:Body><c2c:c2cMessagePublication xmlns:c2c="http://www.ntcip.org/c2c-message-administration"><informationalText>string</informationalText><subscriptionID>string</subscriptionID><subscriptionName>string</subscriptionName><subscriptionFrequency>7</subscriptionFrequency><subscriptionCount>7</subscriptionCount></c2c:c2cMessagePublication><mes:fEUMsg><FEU><restrictions><organization-information-forwarding-restrictions>4</organization-information-forwarding-restrictions></restrictions><message-header><organization-sending><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>3</horizontalDatum><height><altitude><kmDec>1000.00</kmDec></altitude><verticalDatum>1</verticalDatum></height></center-location><center-description>string</center-description><center-type>fixed</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></organization-sending><organizations-receiving><organizations-receiving-item><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>nad27</horizontalDatum><height><verticalLevel>2</verticalLevel></height></center-location><center-description>string</center-description><center-type>fixed</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></organizations-receiving-item></organizations-receiving><organizations-responding><organizations-responding-item><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>wgs-84</horizontalDatum><height><verticalLevel>2</verticalLevel></height></center-location><center-description>string</center-description><center-type>mobile</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></organizations-responding-item></organizations-responding><message-type-version>6</message-type-version><message-number>7</message-number><message-time-stamp><date>stringst</date><time>string</time><offset>strin</offset></message-time-stamp><message-expiry-time><date>stringst</date><time>string</time><offset>strin</offset></message-expiry-time></message-header><event-reference><event-id>string</event-id><event-update>5</event-update><response-plan-id>string</response-plan-id><update-time><date>stringst</date><time>string</time><offset>strin</offset></update-time></event-reference><project-references><project-reference><project-contacts><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>wgs-84egm-96</horizontalDatum><height><altitude><ft>3</ft></altitude><verticalDatum>1</verticalDatum></height></center-location><center-description>string</center-description><center-type>insert-extension-values-here</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></project-contacts></project-reference></project-references><event-indicators><event-indicator><priority-level>6</priority-level></event-indicator></event-indicators><other-references><other-reference><associated-url><url-reference>string</url-reference><url-reference-medium>string</url-reference-medium></associated-url></other-reference></other-references><event-headline><headline><travelerGroupAffected>9472</travelerGroupAffected></headline><headline-element>6</headline-element></event-headline><event-element-details><event-element-detail><element-id>5</element-id><schedule-element-id>5</schedule-element-id><event-category>insert-extension-values-here</event-category><event-source><information-source><organization-id>string</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>string</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>nad83</horizontalDatum><height><altitude><dmDec>1000.00</dmDec></altitude><verticalDatum>wgs-84</verticalDatum></height></center-location><center-description>string</center-description><center-type>2</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>stringst</date><time>string</time><offset>strin</offset></last-update-time></information-source><event-detection-method>7</event-detection-method></event-source><event-descriptions><event-description><quantity><surface-conditions><surface-salinity>5</surface-salinity></surface-conditions></quantity></event-description></event-descriptions><event-locations><event-location><landmark><landmark-type>7</landmark-type><landmark-name>string</landmark-name><landmark-point-name>string</landmark-point-name><location-rank>6</location-rank><geo-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>3</latitude><longitude>3</longitude><horizontalDatum>3</horizontalDatum><height><verticalLevel>2</verticalLevel></height></geo-location><upward-area-reference><area-id>stringstri</area-id><area-name>string</area-name><location-rank>6</location-rank><upward-area-reference/></upward-area-reference></landmark></event-location></event-locations><event-times><update-time><date>stringst</date><time>string</time><offset>strin</offset></update-time><valid-period><effective-periods><effective-period><days-of-the-week>7</days-of-the-week><effective-period-qualifier>day time</effective-period-qualifier><holiday-day>6</holiday-day></effective-period></effective-periods></valid-period><schedule-element-ids><event-schedule-element-identifier>5</event-schedule-element-identifier></schedule-element-ids><sequence-time><date>stringst</date><time>string</time><offset>strin</offset></sequence-time><start-time><date>stringst</date><time>string</time><offset>strin</offset></start-time><alternate-start-time><date>stringst</date><time>string</time><offset>strin</offset></alternate-start-time><alternate-end-time><date>stringst</date><time>string</time><offset>strin</offset></alternate-end-time><expected-start-time><date>stringst</date><time>string</time><offset>strin</offset></expected-start-time><expected-end-time><date>stringst</date><time>string</time><offset>strin</offset></expected-end-time><recurrent-times><recurrent-time><recurrent-period><days-of-the-week>sunday</days-of-the-week><effective-period-qualifier>insert-extension-values-here</effective-period-qualifier><holiday-day>6</holiday-day></recurrent-period><schedule-times><time>string</time></schedule-times><utc-offset>strin</utc-offset></recurrent-time></recurrent-times><planned-event-continuous-flag>2</planned-event-continuous-flag></event-times><event-name>string</event-name><event-lanes><event-lane><lanes-type>string</lanes-type><link-direction>insert-extension-values-here</link-direction><lanes-total-original>6</lanes-total-original><lanes-total-affected>6</lanes-total-affected><event-lanes-affected><lanes>6</lanes></event-lanes-affected><lanes-status>768</lanes-status></event-lane></event-lanes><event-transit-locations><event-transit-location-item><transit-route-id>string</transit-route-id><transit-direction>insert-extension-values-here</transit-direction><transit-stop-detail>string</transit-stop-detail><transit-location-text>string</transit-location-text></event-transit-location-item></event-transit-locations><event-hazmat-details><event-hazmat-details-item><hazmat-code>7</hazmat-code><placard-code>7</placard-code><placard-displayed-accuracy>no</placard-displayed-accuracy></event-hazmat-details-item></event-hazmat-details><confidence-level>7</confidence-level><access-level>all agencies</access-level></event-element-detail></event-element-details><event-comments><event-comment>string</event-comment><operator-id>string</operator-id><operator-comment>string</operator-comment><language>string</language></event-comments><full-report-texts><full-report-text><report-medium>insert-extension-values-here</report-medium><description>string</description><language>string</language></full-report-text></full-report-texts></FEU></mes:fEUMsg></soapenv:Body></soapenv:Envelope>

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates number of publication message transmissions expected as part of this test.
PublicationCount = 0

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether a Publication  error response is expected from the SUT.
PublicationErrorResponseExpected = True

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates the type of Publication response error that is expected from the SUT.
PublicationErrorTypeExpected = 4

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This flag defines whether the Test Application will test for Authentication
AuthenticationCheck = False

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the expected user name.
Username = defaultUser

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the expected password.
Password = defaultPassword

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Organization Identifier.
OrganizationID = defaultOrgID

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether the SUT has the priviledge to access the information requested.
AllowAccess = True

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether a subscription request error is expected from the SUT.
SubscriptionErrorResponseExpected = True

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable indicates the type of subscription request error that is expected from the SUT.
SubscriptionErrorTypeExpected = 4

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Subscription Response Message to be sent to the SUT.
SubscriptionResponseMessage = #MESSAGESPEC#SubResponseMessage#MESSAGESPEC#


#GROUP NAME = Values

